I will not re-open the issue but it is same as https://github.com/cloudflare/terraform-provider-cloudflare/issues/5370
and the issue WAS NOT FIXED. 
Also, the problem in NOT only with `cloudflare_zero_trust_access_application` but with:
1. cloudflare_zero_trust_access_application
2. cloudflare_zero_trust_access_policy
3. cloudflare_zero_trust_access_identity_provider
4. cloudflare_zero_trust_access_group
5. cloudflare_zero_trust_list

and maybe more.

```
 octav@MacBook-Pro-m  ~/cloudflare   main ●  tf apply -auto-approve
cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"]: Refreshing state... [id=f26b2aeb-2b29-41de-cf3be7392ead]
cloudflare_zero_trust_access_group.group["Everyone"]: Refreshing state... [id=587dd4d1-4b7b-4e12-9f07aaa43952]
cloudflare_zero_trust_access_group.group["Developers"]: Refreshing state... [id=771359e1-fb1d-43d8-797a255e78b3]
cloudflare_zero_trust_access_group.group["Admins emails"]: Refreshing state... [id=975f4846-5832-8c21-0c69333a209f]
cloudflare_zero_trust_access_group.group["Nifi operators emails"]: Refreshing state... [id=6f6127e4-499a-8bac-5e21bb580820]
cloudflare_zero_trust_access_group.group["Admins ips"]: Refreshing state... [id=8723aad0-8b14-4f39-c293233fbb6d]
cloudflare_zero_trust_access_policy.policy["Everyone"]: Refreshing state... [id=94a93801-209c-4c36-e8a6cac51d89]
cloudflare_zero_trust_access_policy.policy["Filter by email"]: Refreshing state... [id=6bebb1b4-0da3-a77e-e617d31bde08]
cloudflare_zero_trust_access_policy.policy["Filter by email nifi"]: Refreshing state... [id=47efe264-4c3f-a883-2663da932e70]
cloudflare_zero_trust_access_policy.policy["Filter by ip"]: Refreshing state... [id=ceda7e11-5421-4d49-1e9da73fa590]
cloudflare_zero_trust_access_application.application["Nifi"]: Refreshing state... [id=89153a71-9624-4547-9c984dca96bc]
cloudflare_zero_trust_access_application.application["Name"]: Refreshing state... [id=a14da0c5-b2e2-a396-53a3ccf46684]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.application["Name"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "application" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "d82d033e988ef82e45f2e1ba752c5b95e01ffbf80e0ec" -> (known after apply)
      + cors_headers                 = (known after apply)
      ~ created_at                   = "2025-03-25T14:01:01Z" -> (known after apply)
      + footer_links                 = (known after apply)
        id                           = "a14da0c5-b2e2-a396-53a3ccf46684"
      + landing_page_design          = (known after apply)
        name                         = "Name"
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "ceda7e11-5421-4d49-1e9da73fa590"
              ~ include          = [
                  - {
                      - group = {
                          - id = "8723aad0-8b14-4f39-c293233fbb6d" -> null
                        } -> null
                    },
                  - {
                      - group = {
                          - id = "771359e1-fb1d-43d8-797a255e78b3" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by ip" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "6bebb1b4-0da3-a77e-e617d31bde08"
              ~ include          = [
                  - {
                      - group = {
                          - id = "975f4846-5832-8c21-0c69333a209f" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by email" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      - self_hosted_domains          = [
          - "*.example.com",
        ] -> null
      + skip_app_launcher_login_page = false
      - tags                         = [] -> null
      + target_criteria              = (known after apply)
      ~ updated_at                   = "2025-04-18T09:47:52Z" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.application["Nifi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "application" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "235cc2411ba8b022f70353d1f79cb28edf2e80aa220db077d1b8b5f6d3cee1cf" -> (known after apply)
      + cors_headers                 = (known after apply)
      ~ created_at                   = "2025-03-25T14:01:01Z" -> (known after apply)
      + footer_links                 = (known after apply)
        id                           = "89153a71-9624-4547-9c984dca96bc"
      + landing_page_design          = (known after apply)
        name                         = "Nifi"
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "ceda7e11-5421-4d49-1e9da73fa590"
              ~ include          = [
                  - {
                      - group = {
                          - id = "8723aad0-8b14-4f39-c293233fbb6d" -> null
                        } -> null
                    },
                  - {
                      - group = {
                          - id = "771359e1-fb1d-43d8-797a255e78b3" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by ip" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "47efe264-4c3f-a883-2663da932e70"
              ~ include          = [
                  - {
                      - group = {
                          - id = "6f6127e4-499a-8bac-5e21bb580820" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by email nifi" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      - self_hosted_domains          = [
          - "example.com",
        ] -> null
      + skip_app_launcher_login_page = false
      - tags                         = [] -> null
      + target_criteria              = (known after apply)
      ~ updated_at                   = "2025-04-18T09:47:52Z" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_group.group["Admins ips"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_group" "group" {
      ~ created_at = "2025-03-25T13:30:58Z" -> (known after apply)
        id         = "8723aad0-8b14-4f39-c293233fbb6d"
      ~ include    = [
          ~ {
              ~ ip = {
                  ~ ip = "2a02:2f0f:c00::/64" -> "2a02:2f0f:c00:d4a9:d159:548e:6bbd/64"
                }
            },
            # (5 unchanged elements hidden)
        ]
        name       = "Admins ips"
      ~ require    = [] -> (known after apply)
      ~ updated_at = "2025-04-18T09:47:50Z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "provider" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://example.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
        id          = "f26b2aeb-2b29-41de-cf3be7392ead"
        name        = "Name SSO"
      ~ scim_config = {
          + scim_base_url    = (known after apply)
          - seat_deprovision = false -> null
          + secret           = (sensitive value)
          - user_deprovision = false -> null
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Everyone"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 0 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "94a93801-209c-4c36-e8a6cac51d89"
      + isolation_required             = false
        name                           = "Everyone"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:47:51Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by email"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 1 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "6bebb1b4-0da3-a77e-e617d31bde08"
      + isolation_required             = false
        name                           = "Filter by email"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:47:51Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by email nifi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 1 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "47efe264-4c3f-a883-2663da932e70"
      + isolation_required             = false
        name                           = "Filter by email nifi"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:47:51Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by ip"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 2 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "ceda7e11-5421-4d49-1e9da73fa590"
      + isolation_required             = false
        name                           = "Filter by ip"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:47:51Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"]: Modifying... [id=f26b2aeb-2b29-41de-cf3be7392ead]
cloudflare_zero_trust_access_group.group["Admins ips"]: Modifying... [id=8723aad0-8b14-4f39-c293233fbb6d]
cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"]: Modifications complete after 1s [id=f26b2aeb-2b29-41de-cf3be7392ead]
cloudflare_zero_trust_access_group.group["Admins ips"]: Modifications complete after 1s [id=8723aad0-8b14-4f39-c293233fbb6d]
cloudflare_zero_trust_access_policy.policy["Filter by email"]: Modifying... [id=6bebb1b4-0da3-a77e-e617d31bde08]
cloudflare_zero_trust_access_policy.policy["Everyone"]: Modifying... [id=94a93801-209c-4c36-e8a6cac51d89]
cloudflare_zero_trust_access_policy.policy["Filter by email nifi"]: Modifying... [id=47efe264-4c3f-a883-2663da932e70]
cloudflare_zero_trust_access_policy.policy["Filter by ip"]: Modifying... [id=ceda7e11-5421-4d49-1e9da73fa590]
cloudflare_zero_trust_access_policy.policy["Everyone"]: Modifications complete after 1s [id=94a93801-209c-4c36-e8a6cac51d89]
cloudflare_zero_trust_access_policy.policy["Filter by ip"]: Modifications complete after 1s [id=ceda7e11-5421-4d49-1e9da73fa590]
cloudflare_zero_trust_access_policy.policy["Filter by email nifi"]: Modifications complete after 1s [id=47efe264-4c3f-a883-2663da932e70]
cloudflare_zero_trust_access_policy.policy["Filter by email"]: Modifications complete after 1s [id=6bebb1b4-0da3-a77e-e617d31bde08]
cloudflare_zero_trust_access_application.application["Nifi"]: Modifying... [id=89153a71-9624-4547-9c984dca96bc]
cloudflare_zero_trust_access_application.application["Name"]: Modifying... [id=a14da0c5-b2e2-a396-53a3ccf46684]
cloudflare_zero_trust_access_application.application["Nifi"]: Modifications complete after 1s [id=89153a71-9624-4547-9c984dca96bc]
cloudflare_zero_trust_access_application.application["Name"]: Modifications complete after 1s [id=a14da0c5-b2e2-a396-53a3ccf46684]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 8 changed, 0 destroyed.


###################################################################



 octav@MacBook-Pro-m  ~/cloudflare   main ●  tf plan
Acquiring state lock. This may take a few moments...
cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"]: Refreshing state... [id=f26b2aeb-2b29-41de-cf3be7392ead]
cloudflare_zero_trust_access_group.group["Everyone"]: Refreshing state... [id=587dd4d1-4b7b-4e12-9f07aaa43952]
cloudflare_zero_trust_access_group.group["Admins emails"]: Refreshing state... [id=975f4846-5832-8c21-0c69333a209f]
cloudflare_zero_trust_access_group.group["Nifi operators emails"]: Refreshing state... [id=6f6127e4-499a-8bac-5e21bb580820]
cloudflare_zero_trust_access_group.group["Developers"]: Refreshing state... [id=771359e1-fb1d-43d8-797a255e78b3]
cloudflare_zero_trust_access_group.group["Admins ips"]: Refreshing state... [id=8723aad0-8b14-4f39-c293233fbb6d]
cloudflare_zero_trust_access_policy.policy["Everyone"]: Refreshing state... [id=94a93801-209c-4c36-e8a6cac51d89]
cloudflare_zero_trust_access_policy.policy["Filter by email"]: Refreshing state... [id=6bebb1b4-0da3-a77e-e617d31bde08]
cloudflare_zero_trust_access_policy.policy["Filter by email nifi"]: Refreshing state... [id=47efe264-4c3f-a883-2663da932e70]
cloudflare_zero_trust_access_policy.policy["Filter by ip"]: Refreshing state... [id=ceda7e11-5421-4d49-1e9da73fa590]
cloudflare_zero_trust_access_application.application["Name"]: Refreshing state... [id=a14da0c5-b2e2-a396-53a3ccf46684]
cloudflare_zero_trust_access_application.application["Nifi"]: Refreshing state... [id=89153a71-9624-4547-9c984dca96bc]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.application["Name"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "application" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "d82d033e988ef82e45f2e17729469889d5f95e01ffbf80e0ec" -> (known after apply)
      + cors_headers                 = (known after apply)
      ~ created_at                   = "2025-03-25T14:01:01Z" -> (known after apply)
      + footer_links                 = (known after apply)
        id                           = "a14da0c5-b2e2-a396-53a3ccf46684"
      + landing_page_design          = (known after apply)
        name                         = "Name"
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "ceda7e11-5421-4d49-1e9da73fa590"
              ~ include          = [
                  - {
                      - group = {
                          - id = "8723aad0-8b14-4f39-c293233fbb6d" -> null
                        } -> null
                    },
                  - {
                      - group = {
                          - id = "771359e1-fb1d-43d8-797a255e78b3" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by ip" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "6bebb1b4-0da3-a77e-e617d31bde08"
              ~ include          = [
                  - {
                      - group = {
                          - id = "975f4846-5832-8c21-0c69333a209f" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by email" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      - self_hosted_domains          = [
          - "*.example.com",
        ] -> null
      + skip_app_launcher_login_page = false
      - tags                         = [] -> null
      + target_criteria              = (known after apply)
      ~ updated_at                   = "2025-04-18T09:52:57Z" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.application["Nifi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "application" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "235cc2411ba8b022f70353d80aa220db077d1b8b5f6d3cee1cf" -> (known after apply)
      + cors_headers                 = (known after apply)
      ~ created_at                   = "2025-03-25T14:01:01Z" -> (known after apply)
      + footer_links                 = (known after apply)
        id                           = "89153a71-9624-4547-9c984dca96bc"
      + landing_page_design          = (known after apply)
        name                         = "Nifi"
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "ceda7e11-5421-4d49-1e9da73fa590"
              ~ include          = [
                  - {
                      - group = {
                          - id = "8723aad0-8b14-4f39-c293233fbb6d" -> null
                        } -> null
                    },
                  - {
                      - group = {
                          - id = "771359e1-fb1d-43d8-797a255e78b3" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by ip" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
          ~ {
              + connection_rules = (known after apply)
              ~ exclude          = [] -> (known after apply)
                id               = "47efe264-4c3f-a883-2663da932e70"
              ~ include          = [
                  - {
                      - group = {
                          - id = "6f6127e4-499a-8bac-5e21bb580820" -> null
                        } -> null
                    },
                ] -> (known after apply)
              - name             = "Filter by email nifi" -> null
              ~ require          = [] -> (known after apply)
                # (2 unchanged attributes hidden)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      - self_hosted_domains          = [
          - "example.com",
        ] -> null
      + skip_app_launcher_login_page = false
      - tags                         = [] -> null
      + target_criteria              = (known after apply)
      ~ updated_at                   = "2025-04-18T09:52:57Z" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_group.group["Admins ips"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_group" "group" {
      ~ created_at = "2025-03-25T13:30:58Z" -> (known after apply)
        id         = "8723aad0-8b14-4f39-c293233fbb6d"
      ~ include    = [
          ~ {
              ~ ip = {
                  ~ ip = "2a02:2f0f:c00::/64" -> "2a02:2f0f:c00:d159:548e:6bbd/64"
                }
            },
            # (5 unchanged elements hidden)
        ]
        name       = "Admins ips"
      ~ require    = [] -> (known after apply)
      ~ updated_at = "2025-04-18T09:52:55Z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.provider["OpenID Connect"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "provider" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://example.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
        id          = "f26b2aeb-2b29-41de-cf3be7392ead"
        name        = "Name SSO"
      ~ scim_config = {
          + scim_base_url    = (known after apply)
          - seat_deprovision = false -> null
          + secret           = (sensitive value)
          - user_deprovision = false -> null
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Everyone"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 0 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "94a93801-209c-4c36-e8a6cac51d89"
      + isolation_required             = false
        name                           = "Everyone"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:52:56Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by email"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 1 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "6bebb1b4-0da3-a77e-e617d31bde08"
      + isolation_required             = false
        name                           = "Filter by email"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:52:56Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by email nifi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 1 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "47efe264-4c3f-a883-2663da932e70"
      + isolation_required             = false
        name                           = "Filter by email nifi"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:52:56Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.policy["Filter by ip"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "policy" {
      ~ app_count                      = 2 -> (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      ~ created_at                     = "2025-03-25T13:31:04Z" -> (known after apply)
        id                             = "ceda7e11-5421-4d49-1e9da73fa590"
      + isolation_required             = false
        name                           = "Filter by ip"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-04-18T09:52:56Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```